In [1]:
import pandas as pd

In [2]:
df=pd.read_csv("inconsistent_dataset.csv")

In [3]:
print(df.head)

<bound method NDFrame.head of     ID    Name          Age       City Salary
0    1  Akshay           25      Delhi  50000
1    2   Rohan          NaN      Noida  45000
2    3   Priya           30      Delhi    NaN
3    4   Sneha           22     Mumbai  40000
4    5   Vikas       Twenty      delhi    40k
5    6   Rahul           27      Noida  48000
6    7    Neha           35       Pune  52000
7    8  Anjali           29  Bangalore  47000
8    9   Arjun          NaN      Delhi  46000
9   10  Simran           24        NaN  45000
10  11    Amit           28     Mumbai    NaN
11  12   Pooja           26      Delhi    55k
12  13  Deepak   Thirty-two      Noida  42000
13  14   Kiran           33  Bengaluru  60000
14  15  Manish           40      Delhi  58000
15  16   Suman           22      Noida  41000
16  17   Vivek           21      Delhi  39000
17  18    Alok           34     Mumbai    NaN
18  19   Nisha           36       PUNE  62000
19  20    Ravi           28      Delhi  50000
20  21   Sahil           23      Noida  47000
21  22   Divya            ?  Bangalore  44000
22  23   Rekha           31      Delhi      ?
23  24  Suresh           29     Mumbai  46000
24  25   Jyoti           27      Noida  45000
25  26   Meena          NaN      Delhi  43000
26  27   Kunal           32      Noida  47000
27  28   Harsh  twenty five  bangalore  49000
28  29    Tina           30       Pune    NaN
29  30     Raj           26      Delhi  52000>

In [4]:
df.shape

(30, 5)

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 30 entries, 0 to 29
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   ID      30 non-null     int64
 1   Name    30 non-null     object
 2   Age     27 non-null     object
 3   City    29 non-null     object
 4   Salary  26 non-null     object
dtypes: int64(1), object(4)
memory usage: 1.3+ KB

In [6]:
df.isna().sum

<bound method DataFrame.sum of        ID   Name    Age   City  Salary
0   False  False  False  False   False
1   False  False   True  False   False
2   False  False  False  False    True
3   False  False  False  False   False
4   False  False  False  False   False
5   False  False  False  False   False
6   False  False  False  False   False
7   False  False  False  False   False
8   False  False   True  False   False
9   False  False  False   True   False
10  False  False  False  False    True
11  False  False  False  False   False
12  False  False  False  False   False
13  False  False  False  False   False
14  False  False  False  False   False
15  False  False  False  False   False
16  False  False  False  False   False
17  False  False  False  False    True
18  False  False  False  False   False
19  False  False  False  False   False
20  False  False  False  False   False
21  False  False  False  False   False
22  False  False  False  False   False
23  False  False  False  False   False
24  False  False  False  False   False
25  False  False   True  False   False
26  False  False  False  False   False
27  False  False  False  False   False
28  False  False  False  False    True
29  False  False  False  False   False>

In [7]:
for col in ['Name','City']:
    mask=df[col].str.len() !=df[col].str.strip().str.len()
    if mask.any():
        print(df.loc[mask,col])
        df[['Name','City']]=df[['Name','City']].apply(lambda x: x.str.strip())
        print ("\nSTEP 1_After trimming whitespace:\n ")
        print(df.head(8))

9    NaN
Name: City, dtype: object

STEP 1_After trimming whitespace:

   ID    Name     Age       City Salary
0   1  Akshay      25      Delhi  50000
1   2   Rohan     NaN      Noida  45000
2   3   Priya      30      Delhi    NaN
3   4   Sneha      22     Mumbai  40000
4   5   Vikas  Twenty      delhi    40k
5   6   Rahul      27      Noida  48000
6   7    Neha      35       Pune  52000
7   8  Anjali      29  Bangalore  47000

In [8]:
#Step 2 - Fix inconsistent text case in City column
#Problem: Cities are written with different cases (Delhi, delhi, DELHI, etc.).
#Goal: Standardize them (for example â†’ Title Case: Delhi).
# STEP 2 - Standardize City column (title case)
df['City'] = df[ 'City'].str.title()
print("STEP 2 - After standardizing City column: \n" )
print(df[ 'City'].unique())
# check unique city names

STEP 2 - After standardizing City column:

['Delhi' 'Noida' 'Mumbai' 'Pune' 'Bangalore' nan 'Bengaluru']

In [9]:
# Non-numeric entries (like "Twenty")
# Should be integer numbers
# Code for Cleaning Age
import numpy as np
# STEP 3 - Clean Age column
# 1. Replace word-based numbers manually (if limited cases)
df[ 'Age'] = df[ 'Age' ].replace({
'Twenty': 20,
'Thirty': 30,
'Forty': 40
})
# 2. Convert Age to numeric, forcing errors to NaN
df[ 'Age'] = pd.to_numeric(df['Age'], errors='coerce')
# 3. Optional: Fill missing/invalid ages with median
median_age = df[ 'Age' ].median()
df['Age']=df['Age'].fillna(median_age)
print("STEP 3  -after cleaning age column;\n")
print(df[['ID','Name','Age']].head(10))

STEP 3  -after cleaning age column;

   ID    Name   Age
0   1  Akshay  25.0
1   2   Rohan  28.0
2   3   Priya  30.0
3   4   Sneha  22.0
4   5   Vikas  20.0
5   6   Rahul  27.0
6   7    Neha  35.0
7   8  Anjali  29.0
8   9   Arjun  28.0
9  10  Simran  24.0

In [10]:
# Inconsistent formats (48k, 50,000, extra spaces)
# Needs to be numeric for analysisCode for Cleaning Salary
# STEP 4 - Clean Salary column
# 1. Remove commas and spaces
df[ 'Salary'] = df['Salary'].astype(str).str.replace(",", " ").str.strip()
# 2. Handle values like "40k" -> 40000
df[ 'Salary'] = df['Salary'].str. replace("k", "000", case=False)
#. 3. Convert to numeric (invalid values -> NaN)
df[ 'Salary'] = pd.to_numeric(df['Salary'], errors='coerce')
#Optional: Fill missing salaries with median
median_salary = df['Salary' ].median()
df[ 'Salary'] = df[ 'Salary'].fillna(median_salary)
print("STEP 4 - After cleaning Salary column:\n")
print(df[['ID', 'Name', 'Salary' ]].head(10))

STEP 4 - After cleaning Salary column:

   ID    Name   Salary
0   1  Akshay  50000.0
1   2   Rohan  45000.0
2   3   Priya  47000.0
3   4   Sneha  40000.0
4   5   Vikas  40000.0
5   6   Rahul  48000.0
6   7    Neha  52000.0
7   8  Anjali  47000.0
8   9   Arjun  46000.0
9  10  Simran  45000.0

In [11]:
# Let's wrap it up with Step 5 - Final consistency check.
# Code for Step 5
# STEP 5 - Final consistency check
print("STEP 5 - Shape of dataset:", df.shape)
print("\nColumn data types:")
print(df.dtypes)
print("\nMissing values after cleaning:")
print(df.isna().sum())
print("InSummary statistics:")
print(df.describe(include='all'))
print("\nFinal snapshot of cleaned dataset:")
print(df.head(10))

STEP 5 - Shape of dataset: (30, 5)

Column data types:
ID          int64
Name       object
Age       float64
City       object
Salary    float64
dtype: object

Missing values after cleaning:
ID        0
Name      0
Age       0
City      1
Salary    0
dtype: int64
InSummary statistics:
               ID    Name        Age   City        Salary
count   30.000000      30  30.000000     29     30.000000
unique        NaN      30        NaN      6           NaN
top           NaN  Akshay        NaN  Delhi           NaN
freq          NaN       1        NaN     11           NaN
mean    15.500000     NaN  28.200000    NaN  47600.000000
std      8.803408     NaN   4.536442    NaN   5580.755109
min      1.000000     NaN  20.000000    NaN  39000.000000
25%      8.250000     NaN  26.000000    NaN  45000.000000
50%     15.500000     NaN  28.000000    NaN  47000.000000
75%     22.750000     NaN  30.000000    NaN  49750.000000
max     30.000000     NaN  40.000000    NaN  62000.000000

Final snapshot of cleaned dataset:
   ID    Name   Age       City   Salary
0   1  Akshay  25.0      Delhi  50000.0
1   2   Rohan  28.0      Noida  45000.0
2   3   Priya  30.0      Delhi  47000.0
3   4   Sneha  22.0     Mumbai  40000.0
4   5   Vikas  20.0      Delhi  40000.0
5   6   Rahul  27.0      Noida  48000.0
6   7    Neha  35.0       Pune  52000.0
7   8  Anjali  29.0  Bangalore  47000.0
8   9   Arjun  28.0      Delhi  46000.0
9  10  Simran  24.0        NaN  45000.0

In [12]:
# Let's make it a separate Step 6 - Handle missing values in categorical columns.
# STEP 6 - Handle missing City values
# Option 1: Fill with "Unknown"
df['City'] = df['City'].fillna ("Unknown")
# OR Option 2: Fill with most frequent city (mode)
#mode_city = df[ 'City'].mode() [0]
# df["City' ] = df['City'].fillna(mode_city)
print("STEP. 6 - After handling missing City values: \n")
print(df[ 'City' ].unique())
print("\nMissing values check:\n", df.isna().sum())

STEP. 6 - After handling missing City values:

['Delhi' 'Noida' 'Mumbai' 'Pune' 'Bangalore' 'Unknown' 'Bengaluru']

Missing values check:
 ID        0
Name      0
Age       0
City      0
Salary    0
dtype: int64

In [13]:
# Let's finalize by exporting the cleared dataset.
# STEP 7 - Export cleaned dataset to CSV
output_file = "Cleaned.csv"
df.to_csv(output_file, index=False)
print(f"STEP 7 - Cleaned dataset exported successfully as (output_file)")

STEP 7 - Cleaned dataset exported successfully as (output_file)

In [30]:
# step 8(statistics-standard deviation) Mean, Median, Mode
print("Age - Mean:", df["Age"].mean(), "Median:", df["Age"].median(), "Mode:", df["Age"].mode()[0])
print("Salary - Mean:", df["Salary"].mean(), "Median:", df["Salary"].median(), "Mode:", df["Salary"].mode()[0])

Age - Mean: 28.2 Median: 28.0 Mode: 28.0
Salary - Mean: 47600.0 Median: 47000.0 Mode: 47000.0